---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyCannotBeUpgraded
source: html/63fb5e44-37be-f197-bb0f-625603a08ee8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyCannotBeUpgraded Property

"Family '[Name]' cannot be upgraded and must be deleted. To fix the file in the older version of Revit, try loading newer versions of these families: [Names]."

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyCannotBeUpgraded { get; }
```